In [1]:
import pandas as pd

record1={'Name':'Dahou','Grade':'1CS','Age':21}
record2={'Name':'Ali','Grade':'2CS','Age':20}
record3={'Name':'Alison','Grade':'1CP','Age':18}

df=pd.DataFrame([record1,record2,record3],
               index=['Person1','Person2','Person3'])
df

           Name Grade  Age
Person1   Dahou   1CS   21
Person2     Ali   2CS   20
Person3  Alison   1CP   18

In [2]:
#We can use the function head to display the first several items

df.head()

           Name Grade  Age
Person1   Dahou   1CS   21
Person2     Ali   2CS   20
Person3  Alison   1CP   18

In [3]:
# An alternative method is that you could use a list of dictionaries, where each dictionary 
# represents a row of data.

students = [{'Name': 'Alice',
              'Class': 'Physics',
              'Score': 85},
            {'Name': 'Jack',
             'Class': 'Chemistry',
             'Score': 82},
            {'Name': 'Helen',
             'Class': 'Biology',
             'Score': 90}]

# Then we pass this list of dictionaries into the DataFrame function
df = pd.DataFrame(students, index=['school1', 'school2', 'school1'])
# And lets print the head again
df.head()

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [4]:
# Similar to the series, we can extract data using the .iloc and .loc attributes. Because the 
# DataFrame is two-dimensional, passing a single value to the loc indexing operator will return 
# the series if there's only one row to return.

# For instance, if we wanted to select data associated with school2, we would just query the 
# .loc attribute with one parameter.
df.loc['school2']

Name          Jack
Class    Chemistry
Score           82
Name: school2, dtype: object

In [5]:
df.loc['school1']

          Name    Class  Score
school1  Alice  Physics     85
school1  Helen  Biology     90

In [7]:
#iloc to precize the number of the row to retrieve
df.iloc[1]

Name          Jack
Class    Chemistry
Score           82
Name: school2, dtype: object

In [8]:
type(df.loc['school2'])

pandas.core.series.Series

In [9]:
type(df.loc['school1'])

pandas.core.frame.DataFrame

In [17]:
# One of the powers of the Panda's DataFrame is that you can quickly select data based on multiple axes.
# For instance, if you wanted to just list the student names for school1, you would supply two 
# parameters to .loc, one being the row index and the other being the column name.

# For instance, if we are only interested in school1's student names
df.loc['school1', 'Name']

school1    Alice
school1    Helen
Name: Name, dtype: object

In [19]:
#Get a single column by using the transpose of the DataFrame
df.T.loc['Name']

school1    Alice
school2     Jack
school1    Helen
Name: Name, dtype: object

In [20]:
#Get a single column by using projection
df['Name']

school1    Alice
school2     Jack
school1    Helen
Name: Name, dtype: object

In [21]:
#can't use df.loc['Name']

In [22]:
# Note too that the result of a single column projection is a Series object
type(df['Name'])

pandas.core.series.Series

In [24]:
print(type(df.loc['school1'])) #should be a DataFrame
print(type(df.loc['school1']['Name'])) #should be a Series

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [25]:
#Get a single or multiple columns by slicing 
df.loc[:,['Name', 'Score']]

          Name  Score
school1  Alice     85
school2   Jack     82
school1  Helen     90

In [26]:
df.loc[:,['Name']] #data frame

          Name
school1  Alice
school2   Jack
school1  Helen

In [28]:
df.loc[:,'Name']  #Serie

school1    Alice
school2     Jack
school1    Helen
Name: Name, dtype: object

# Deleting in data frames

In [29]:
#1----by using drop
df.drop('school2')

          Name    Class  Score
school1  Alice  Physics     85
school1  Helen  Biology     90

In [30]:
#well actualle drop function create a copy of the original data frame and delete the row without 
#affecting the original data frame
#let's check the original data frame
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [32]:
#To use drop to delete the item from the original dataframe we need to use inplace attribute
#axis=0 for rows , and axis=1 for columns

#let's create a copy of df
copydf=df.copy()
copydf.drop('school2',inplace=True,axis=0)
copydf

          Name    Class  Score
school1  Alice  Physics     85
school1  Helen  Biology     90

In [33]:
#To delete the column we use axis=1
copydf.drop('Name',inplace=True,axis=1)
copydf

           Class  Score
school1  Physics     85
school1  Biology     90

In [35]:
#2-----using del function for deleting columns

del copydf['Score']
copydf

           Class
school1  Physics
school1  Biology

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [49]:
#Adding new item it also create a copy of the data frame added to a new item it doesnt modify the original
#data frame
item={'Name': 'Helen',
             'Class': 'Biology',
             'Score': 90}
df.append(pd.Series(item,name='school3'),ignore_index=False)

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90
school3  Helen    Biology     90

In [50]:
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [55]:
#Adding a new column
df['New column']=['1','2','3']
df

          Name      Class  Score New column
school1  Alice    Physics     85          1
school2   Jack  Chemistry     82          2
school1  Helen    Biology     90          3

In [56]:
#Adding a new column with none values
df['None column']=None
df

          Name      Class  Score New column None column
school1  Alice    Physics     85          1        None
school2   Jack  Chemistry     82          2        None
school1  Helen    Biology     90          3        None